Config/InformationRegisters/УстановленныеКомплектыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеКомплектыОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзмененийHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Если Истина, то по умолчанию не будет установлен флаг в загрузке комплекта и не будет оповещать о новой версии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ВерсииУстановленныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииУстановленныхОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/УстановленныеКомплектыОтчетности/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОписаниеИзменений(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ПараметрыФормы = Новый Структура("КлючДанных", ТекущиеДанные);
		ОткрытьФорму("РегистрСведений.УстановленныеКомплектыОтчетности.Форма.ИнформацияОКомплекте",ПараметрыФормы,ЭтаФорма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо выбрать строку в списке'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОтбораСпискаОтчетов(Знач КлючЗаписи)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановленныеКомплектыОтчетности.Версия
	|ИЗ
	|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
	|ГДЕ
	|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта = &ИдентификаторКомплекта";
	
	Запрос.УстановитьПараметр("ИдентификаторКомплекта",КлючЗаписи.ИдентификаторКомплекта);
	
	СтруктураКлюча = Новый Структура;
	Выборка        = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураКлюча.Вставить("ИдентификаторКомплекта",КлючЗаписи.ИдентификаторКомплекта);
		СтруктураКлюча.Вставить("Версия"                ,Выборка.Версия);
		
	КонецЕсли;
	
	Возврат СтруктураКлюча;

КонецФункции // ПараметрыОтбораСпискаОтчетов()


&НаКлиенте
Процедура ВидыОтчетаТекущейВерсии(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ПараметрыФормы = Новый Структура("Отбор",ПараметрыОтбораСпискаОтчетов(ТекущиеДанные));
		
		ОткрытьФорму("РегистрСведений.ВерсииУстановленныхОтчетов.ФормаСписка", ПараметрыФормы, ЭтаФорма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо выбрать строку в списке'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИдКомплекта = ТекДанные.ИдентификаторКомплекта;
	
	ТекстВопроса = НСтр("ru='Удалить запись?'");
	ОпОв = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект,ИдКомплекта);
	ПоказатьВопрос(ОпОв,ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, ИдКомплекта)Экспорт
	Если Результат<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	УдалитьЗаписьНаСервере(ИдКомплекта);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере(ИдКомплекта)
	Запись = РегистрыСведений.УстановленныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторКомплекта = ИдКомплекта;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры
